import { useState } from 'react'
import './hintPage.css'

const HintPage = ({changePage}) => {
  const [hintPageNumber, setHintPageNumber] = useState(0)

  const changeHintPageNumberF = () => {
    const nextPage = hintPageNumber +1
    setHintPageNumber(nextPage)
  }
  const changeHintPageNumberB = () => {
    const nextPage = hintPageNumber -1
    setHintPageNumber(nextPage)
  }

  const changePageToGamePage =() => {
    changePage('gamePage')
  }
  const changePageToMenuPage =() => {
    changePage('mainMenu')
  }
  return (
  <div className ='hintPageBox'>
    {
      hintPageNumber === 0 &&
      <div className='howtoplayBox'>
        <h1>اجزا بازی</h1>
        <p> صفحه بازی </p>
        <p>شش تا مکعب قرمز رنگ یا همون کارمندان بازی</p>
        <p>چهارتا تا مکعب بزرگتر توی رنگهای سفید مشکی سبز و آبی یا همون معاونین بازی</p>
        <p>چهارتا تا استوانه توی رنگهای سفید مشکی سبز و آبی یا همون رییسهای بازی</p>
      </div>
    }
    {
      hintPageNumber === 1 &&
      <div className='howtoplayBox'>
        <h1>آموزش بازی</h1>
        <p>توی این بازی شما نقش کارمندان اداره ای رو دارین که میتونن رییسها و معاونهاشون رو کنترل کنن</p>
        <p>توی بازی شما فقط میتونین مکعبهای قرمز رنگ رو توی چهارجهت بالا.پایین.چپ و راست تکون بدین</p>
        <p>وقتی کارمند یا همون مکعب قرمز رنگی رو تکون بدین. معاونها و رییس هایی که توی صفحه هستند هم تکون میخورن</p>
      </div>
    }
    {
      hintPageNumber === 2 &&
      <div className='howtoplayBox'>
        <p>معاونها همون مکعبهای بزرگتر توی چهارتا رنگ سفید. مشکی. سبز و آبی هستند و توی همون جهتی حرکت میکنن که کارمندارو تکون میدین</p>
        <p>مثال: اگر مهره کارمند به سمت راست حرت کنه. مهره معاون سفید هم یک خانه در همون جهت حرکت میکنه</p>
        <p>همینطور مهره معاون مشکی وقتی حرکت میکنه که مهره کارمند مثلا در جهت راست دوبار تکون داده بشه</p>
        <p>همینطور مهره معاون سبزرنگ وقتی حرکت میکنه که مهره کارمند سه بار تکون داده بشه</p>
        <p> و درآخر مهره معاون آبی وقتی حرکت میکنه که مهره کارمند توی جهتی چهاربار تکون داده بشه</p>
      </div>
    }
    {
      hintPageNumber === 3 &&
      <div className='howtoplayBox'>
        <p>رییسها یا همون استوانه ها که توی چهارتا رنگ سفید. مشکی. سبز و آبی هستند. برعکس اون جهتی حرکت میکنن که کارمندارو تکون میدین</p>
        <p>مثال: اگر مهره کارمند به سمت راست حرت کنه. مهره رییس سفید یک خانه برعکس همون جهت و به سمت چپ حرکت میکنه</p>
        <p>همینطور مهره رییس مشکی وقتی حرکت میکنه که مهره کارمند دوبار تکون داده بشه</p>
        <p>همینطور مهره رییس سبزرنگ وقتی حرکت میکنه که مهره کارمند سه بار تکون داده بشه</p>
        <p> و درآخر مهره رییس آبی وقتی حرکت میکنه که مهره کارمند توی جهتی چهاربار تکون داده بشه</p>
      </div>
    }
        {
      hintPageNumber === 4 &&
      <div className='howtoplayBox'>
        <p>ترتیب حرکت کردن مهره ها اینطوریه (فقط مهره هایی که روی صفحه حضور داشته باشن)</p>
        <p>اول شما مهره کارمند رو تکون میدین</p>
        <p>بعد مهره معاون سفید تکون میخوره</p>
        <p>بعد رییس سفید رنگ</p>
        <p>بعد معاون مشکی رنگ و بعد رییس مشکی رنگ</p>
        <p>بعد معاون سبز رنگ و بعد رییس سبز رنگ</p>
        <p>بعد معاون آبی رنگ و بعد رییس آبی رنگ</p>
      </div>
    }
    {
      hintPageNumber === 5 &&
      <div className='howtoplayBox'>
        <p>به طور مثال اگر مهره کارمند سه خانه به سمت بالا بره</p>
        <p>مهره معاون سفید رنگ سه خانه به سمت بالا میره</p>
        <p>بعد مهره رییس سفید رنگ سه خانه به سمت پایین میره</p>
        <p>بعد مهره معاون مشکی رنگ یک خانه به سمت بالا میره</p>
        <p>بعد مهره رییس مشکی رنگ یک خانه به سمت پایین میره</p>
        <p>بعد مهره معاون سبز رنگ یک خانه به سمت بالا میره</p>
        <p>بعد مهره رییس سبز رنگ یک خانه به سمت پایین میره</p>
        <p>و مهره معاون و مهره رییس آبی رنگ هم تکون نمیخوره</p>
      </div>
    }
    {
      hintPageNumber === 6 &&
      <div className='howtoplayBox'>
        <p>توی هرمرحله یه چیدمان اولیه وجود داره. که براساس اون باید مهره هارو روی صفحه بچینین</p>
        <p>البته توی نسخه وب مهره ها توی حالت اولیه چیده شدن. ولی توی نسخه فیزیکی کارتهایی وجود داره که به شما نسخه اولیه رو نشون میده</p>
        <p>بعدازاینکه مهره هارو چیدین بازی شروع میشه. شما باید با کمک کارمندها و تکون دادنشون. به حالتی برسین که کارت هدف ازتون میخواد</p>
        <p>مثال: کارت هدف ازتون میخواد که مهره معاون سفید رو به یکی از گوشه های صفحه بازی برسونین</p>
      </div>
    }
    {
      hintPageNumber === 7 &&
      <div className='howtoplayBox'>
        <p>هر مرحله از بازی یک کارت چینش اولیه و چندین کارت هدف داره که به ترتیب باید انجام بشه</p>
        <p>وقتی کارت هدفی رو انجام میدین. باعث میشه مهره های بعدی و بیشتری وارد صفحه بازی بشن. و رفته رفته بازی سخت تر میشه. کارتهای هدف به ترتیب نشون میدن که مهره های بعدی توی چه مکانی وارد صفحه بازی بشه</p>
        <p>وقتی تونستین که تمامی مهره های رییس و معاون هارو وارد بازی کنین و توی مکانهای خواسته شده قرار بدین. وارد مرحله پایانی میشین. آخرین کارت هدف به شما جای قرارگیری کارمندهارو میگه</p>
      </div>
    }
    {
      hintPageNumber === 8 &&
      <div className='howtoplayBox'>
        <p>قوانین تکمیلی</p>
        <p>مهره های کارمند میتونن روی همدیگه برن. ولی مهره های معاون و رییس نمیتونن روی همدیگه قرار بگیرن</p>
        <p>مهره های معاون و رییس با باقی مهره ها بلاک میشن. اگر مهره دیگه ای توی مسیرشون باشه. اونها تکون نمیخورن</p>
        <p>بلاک کردن مهره های رییس و معاون توی حل معماها خیلی میتونه کمک بکنه</p>
        <p>وقتی مهره معاون یا رییس با مهره های دیگه بلاک شدن. شما میتونین مهره کارمندهارو تکون بدین ولی اون مهره ی بلاک شده تکون نمیخوره</p>
      </div>
    }
    {
      hintPageNumber === 9 &&
      <div className='howtoplayBox'>
        <p>قوانین تکمیلی</p>
        <p>اما وقتی مهره های معاون و رییس به لبه های صفحه بازی میرسن. باعث بلاک شدن مهره های کارمندها میشن</p>
        <p>به طور مثال اگر مهره معاون سفید رنگ توی لبه سمت راست صفحه بازی باشه. شما نمیتونین مهره کارمندتون رو به سمت راست حرکت بدین. چون مهره معاون سفید به نهایت خودش رسیده و نمیتونه به سمت راست تکون بخوره</p>
      </div>
    }
    {
      hintPageNumber === 10 &&
      <div className='howtoplayBox'>
        <p>حالا که قوانین بازی رو فهمیدین بهتره که وارد بازی بشین</p>
        <button className='play nextButton' onClick={changePageToGamePage}>شروع بازی</button>
      </div>
    }

    <div>
    {<button className='nextButton menu' onClick={changePageToMenuPage}>منو</button>}
    {hintPageNumber > 0 && <button className='nextButton' onClick={changeHintPageNumberB}>قبلی</button>}
    {hintPageNumber < 10 && <button className='nextButton' onClick={changeHintPageNumberF}>بعدی</button>}
    </div>
  </div>
  )

}

export default HintPage